In [5]:
#analisando o arquivo de fenomenos extraterrestre - ufo

import pandas as panda
import numpy

arquivoUfo = panda.read_csv("C:\\GIT\\DataScience\\Datasets\\ufo.csv") #as precisa de 2 \\ as vezez uma barra \
#mas se colocar com duas barras \\, sempre funciona
arquivoUfo.tail(5) #tail retorna o final do arquivo

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [7]:
# NaN - not a number é um valor nulo
#no arquivo ufo, tem valores NaN - nulos?

arquivoUfo.isnull().tail(5)
#arquivoUfo.notnull().tail(5)

       City  Colors Reported  Shape Reported  State  Time
18236  True            False            True   True  True
18237  True            False            True   True  True
18238  True            False           False   True  True
18239  True             True            True   True  True
18240  True            False            True   True  True

In [8]:
#Quantidade de valores nulos por colunas

#O arquivo possui valores nulos? SIM
arquivoUfo.isnull().sum() #isnull retorna valores booleanos (True=1/False=0) e Sum soma a ocorrencia da afirmação (aula 10)

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [11]:
#Filtro - buscando Cidades na tabela onde o valor é nulo

arquivoUfo[arquivoUfo.City.isnull()].head(10)

     City Colors Reported Shape Reported State              Time
21    NaN             NaN            NaN    LA    8/15/1943 0:00
22    NaN             NaN          LIGHT    LA    8/15/1943 0:00
204   NaN             NaN           DISK    CA   7/15/1952 12:30
241   NaN            BLUE           DISK    MT    7/4/1953 14:00
613   NaN             NaN           DISK    NV    7/1/1960 12:00
1877  NaN          YELLOW         CIRCLE    AZ    8/15/1969 1:00
2013  NaN             NaN            NaN    NH     8/1/1970 9:30
2546  NaN             NaN       FIREBALL    OH  10/25/1973 23:30
3123  NaN             RED       TRIANGLE    WV  11/25/1975 23:00
4736  NaN             NaN         SPHERE    CA   6/23/1982 23:00

In [17]:
#Dropna - ANY - apaga alinha inteira da tabela-dataFrame se encontrar um valor nulo

ufoSemNAN = arquivoUfo.dropna(how='any')
ufoSemNAN.head(5) #2486 linhas sem valores nulos - NAN

          City Colors Reported Shape Reported State             Time
12      Belton             RED         SPHERE    SC  6/30/1939 20:00
19  Bering Sea             RED          OTHER    AK  4/30/1943 23:00
36  Portsmouth             RED      FORMATION    VA   7/10/1945 1:30
44   Blairsden           GREEN         SPHERE    CA  6/30/1946 19:00
82    San Jose            BLUE        CHEVRON    CA  7/15/1947 21:00

In [20]:
#dropna nao altera o dataFrame original, caso queira salvar a informação, atribuo o resultado a uma nova variavel (boas praticas)
totalLinhas = arquivoUfo.dropna(how='any').shape
tatalLinhasSemNulos = arquivoUfo.shape

#Shape retorna um tupla, por isso é necessario acessar o valor de linha por posicao
totalLinhasExcluidas = totalLinhas[0] - tatalLinhasSemNulos[0]
totalLinhasExcluidas

-15755

In [21]:
#Dropna - ALL - se todos valores da linha for nulo, deleta

arquivoUfo.dropna(how='all').shape #nao deletou nenhuma linha, pois nao existe nenhuma com todos os valores nulos

(18241, 5)

In [23]:
#Dropna - Subset - Any - se um valor ou outro estiver nula, deletar

arquivoUfo.dropna(subset=['City', 'Shape Reported'], how='any').shape #se Cidade ou Formato forem nulos, deleta

(15576, 5)

In [24]:
#Dropna - Subset - All - se os dois ou maais paramentos forem nulos

arquivoUfo.dropna(subset=['City', 'Shape Reported'], how='all').shape #se Cidade e Formato forem nulos, deleta

(18237, 5)

In [26]:
#Value_counts - retorna somente valores que nao possui campos nulos

arquivoUfo['Shape Reported'].value_counts().head(5)

LIGHT       2803
DISK        2122
TRIANGLE    1889
OTHER       1402
CIRCLE      1365
Name: Shape Reported, dtype: int64

In [27]:
#Value_counts - dropna - conta os valores nulos

arquivoUfo['Shape Reported'].value_counts(dropna=False).head(5)

LIGHT       2803
NaN         2644
DISK        2122
TRIANGLE    1889
OTHER       1402
Name: Shape Reported, dtype: int64

In [30]:
#Fillna - Implace - alterar, trocar NaN/nulo por 'Diversos'
#lembra-se que o inplace altra o dataFrame original

arquivoUfo['Shape Reported'].fillna(value='Diversos', inplace=True)
arquivoUfo['Shape Reported'].value_counts().head(5) #agora no lugar de NaN temos a descrição "diversos"

LIGHT       2803
Diversos    2644
DISK        2122
TRIANGLE    1889
OTHER       1402
Name: Shape Reported, dtype: int64